[
  {
    "id": "software-developer-intern",
    "title": "Software Developer Intern",
    "type": "Internship",
    "typeColor": "green",
    "description": "Join our engineering team as an intern to learn and contribute to building modern web applications. You'll work alongside experienced developers and gain hands-on experience with industry-standard technologies.",
    "skills": ["TypeScript", "React", "Django", "Git", "Node.js", "REST APIs"],
    "location": "Lusaka, Zambia",
    "experience": "Entry Level",
    "department": "Engineering",
    "minimumQualifications": [
      "Currently pursuing a Bachelor's degree in Computer Science, Software Engineering, or related field",
      "Basic understanding of programming concepts and web development",
      "Familiarity with Python, React, and TypeScript",
      "Understanding of version control systems (Git)",
      "Strong problem-solving skills and attention to detail",
      "Ability to work collaboratively in a team environment"
    ],
    "preferredQualifications": [
      "Experience with React or other TypeScript frameworks",
      "Basic knowledge of Node.js and backend development",
      "Understanding of databases and SQL",
      "Participation in coding bootcamps or online courses",
      "Personal projects showcasing programming skills",
      "Interest in learning new technologies and best practices"
    ],
    "aboutTheJob": "As a Software Developer Intern at iZyane, you'll have the opportunity to learn and grow in a dynamic, fast-paced environment. You'll work alongside experienced engineers and contribute to real projects while gaining valuable industry experience. This internship is designed to provide hands-on learning opportunities and mentorship to help you develop your technical skills and understanding of software development best practices.",
    "responsibilities": [
      "Assist in developing and maintaining web applications under supervision",
      "Write clean, well-documented code following team guidelines",
      "Participate in code reviews and learn from feedback",
      "Collaborate with team members on feature development",
      "Learn and apply software development best practices",
      "Attend team meetings and contribute to project discussions",
      "Work on assigned tasks and small features independently",
      "Document your learning and share insights with the team"
    ]
  }
]