[
  {
    "id": "1",
    "icon": "fas fa-laptop-code",
    "title": "Software, Mobile & Web Development",
    "description": "End-to-end development services for individuals and businesses seeking high-quality software, mobile, and web solutions. We build scalable, user-centered products using modern technologies to transform ideas into production-ready applications.",
    "detailedDescription": "We deliver robust full-stack web applications and high-performance mobile apps. From single-page apps to enterprise systems and native or cross-platform mobile solutions, our team focuses on performance, security, and user engagement.",
    "features": [
      "Full-stack development (React, Node.js, Python)",
      "Cloud deployment & CI/CD",
      "Native iOS & Android and cross-platform (React Native, Flutter)",
      "App Store / Play Store publishing & optimization"
    ]
  },
  {
    "id": "2",
    "icon": "fas fa-exchange-alt",
    "title": "Mojaloop Integration",
    "description": "Secure, compliant Mojaloop integration to enable inclusive, interoperable digital payments across platforms and borders.",
    "detailedDescription": "Our certified IIPS team deploys Mojaloop to cloud environments and configures APIs for real-time, low-latency financial transactions with enterprise-grade security and compliance.",
    "features": [
      "Mojaloop API integration",
      "Real-time transaction processing & synchronization",
      "Security, compliance & auditing"
    ]
  },
  {
    "id": "3",
    "icon": "fas fa-users-cog",
    "title": "Agency & Merchant Aggregation",
    "description": "Onboarding and aggregation platform for agents and merchants to streamline trade development and expand distribution networks.",
    "detailedDescription": "We build proprietary onboarding applications to efficiently register, manage, and scale agent and merchant networks with integrated compliance and reporting.",
    "features": [
      "Agent & merchant onboarding workflows",
      "Identity verification & KYC support",
      "Merchant management dashboard"
    ]
  },
  {
    "id": "4",
    "icon": "fas fa-server",
    "title": "Supply & Implementation of ERP Systems",
    "description": "Tailored ERP solutions for SMEs to centralize operations, improve efficiency, and scale with business growth.",
    "detailedDescription": "We offer ERP selection, customization, data migration, and rollout services—including training and post-go-live support—to ensure a smooth transition and measurable gains.",
    "features": [
      "System assessment & selection",
      "Custom configuration & workflows",
      "Data migration & user training"
    ]
  },
  {
    "id": "5",
    "icon": "fas fa-chart-line",
    "title": "Business Process Re-Engineering (BPR)",
    "description": "Redesign core business processes to reduce costs, remove inefficiencies, and improve organizational performance.",
    "detailedDescription": "Our consultants analyze current operations, design optimized workflows, and implement change management strategies to embed new, measurable processes.",
    "features": [
      "Process mapping & analysis",
      "Workflow redesign & automation",
      "Change management and KPI definition"
    ]
  },
  {
    "id": "6",
    "icon": "fas fa-store",
    "title": "POS Supply & Application Development",
    "description": "Integrated Android smart POS hardware and bespoke POS applications for reliable retail and payment operations.",
    "detailedDescription": "We supply POS hardware, develop custom Android POS apps, and integrate payment gateways and inventory systems for seamless retail operations.",
    "features": [
      "POS hardware procurement & setup",
      "Custom POS app development",
      "Payment gateway & peripheral integration"
    ]
  },
  {
    "id": "7",
    "icon": "fas fa-rocket",
    "title": "Go-to-Market Strategy for Digital Solutions",
    "description": "End-to-end GTM planning and execution to help digital newcomers successfully launch and scale products.",
    "detailedDescription": "We combine market research, positioning, launch planning, and performance marketing to maximize early adoption and sustainable growth.",
    "features": [
      "Market research & competitor analysis",
      "Product positioning & messaging",
      "Launch planning & campaign execution"
    ]
  },
  {
    "id": "8",
    "icon": "fas fa-bullhorn",
    "title": "Digital Marketing, Branding & Advertising",
    "description": "Strategic digital marketing and creative branding to grow visibility, engagement, and conversions.",
    "detailedDescription": "We deliver brand identity work, content strategy, and performance advertising across search, social, and display channels to meet measurable business goals.",
    "features": [
      "Brand strategy & visual identity",
      "Digital advertising & content marketing",
      "SEO, social media, and analytics"
    ]
  },
  {
    "id": "9",
    "icon": "fas fa-landmark",
    "title": "Core Banking Implementation Consultancy",
    "description": "Expert consultancy for implementation, optimization, and support of core banking systems—specializing in Oracle FLEXCUBE.",
    "detailedDescription": "With 10+ years of experience, our certified team manages selection, implementation planning, regulatory compliance, and knowledge transfer for core banking transformations.",
    "features": [
      "System selection & readiness assessment",
      "Implementation planning & project governance",
      "Regulatory compliance and operational readiness"
    ]
  },
  {
    "id": "10",
    "icon": "fas fa-shield-alt",
    "title": "Security Solutions",
    "description": "Comprehensive cybersecurity solutions to protect your digital assets and infrastructure.",
    "detailedDescription": "Safeguard your business with our comprehensive security solutions. We provide end-to-end cybersecurity services including risk assessment, security architecture design, implementation of security controls, and ongoing monitoring to protect your digital assets from evolving threats.",
    "features": [
      "Security Assessment & Auditing",
      "Infrastructure Protection",
      "Compliance & Risk Management"
    ]
  }
]